---
icon: edit
date: 2022-10-14
order: 20221014
sticky: false
star: false
category:
  - 小收获
tag:
  - 编译器
  - C++
---

关于C++对象布局的一些知识

<!-- more -->

# 2022-10-14 C++对象布局

## 普通类布局查看
```cpp
struct Base {
  Base() = default;
  ~Base() = default;

  void Func();

  int a;
  int b;
};

int main() {
  Base b;
  return 0;
}
```

使用命令`clang -Xclang -fdump-record-layouts --stdlib=libc++ -c model.cpp`进行编译，编译结果如下

可以看到a, b分别占据4字节，Func函数没有占用

```shell

*** Dumping AST Record Layout
         0 | struct Base
         0 |   int a
         4 |   int b
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x921790 <model.cpp:1:1, line:9:1> line:1:8 referenced struct Base definition
|-DefinitionData pass_in_registers aggregate standard_layout trivially_copyable trivial literal has_user_declared_ctor
| |-DefaultConstructor exists trivial
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor
| |-CopyAssignment simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment
| `-Destructor irrelevant trivial user_declared
|-CXXRecordDecl 0x9218a8 <col:1, col:8> col:8 implicit referenced struct Base
|-CXXConstructorDecl 0x9219c8 <line:2:3, col:18> col:3 used Base 'void () noexcept' default trivial
| `-CompoundStmt 0x922128 <col:18>
|-CXXDestructorDecl 0x921ab8 <line:3:3, col:19> col:3 ~Base 'void ()' default trivial noexcept-unevaluated 0x921ab8
|-CXXMethodDecl 0x921bc0 <line:5:3, col:13> col:8 Func 'void ()'
|-FieldDecl 0x921c78 <line:7:3, col:7> col:7 a 'int'
|-FieldDecl 0x921ce0 <line:8:3, col:7> col:7 b 'int'
`-CXXConstructorDecl 0x921f68 <line:1:8> col:8 implicit constexpr Base 'void (const Base &)' inline default trivial noexcept-unevaluated 0x921f68
  `-ParmVarDecl 0x922078 <col:8> col:8 'const Base &'

Layout: <CGRecordLayout
  LLVMType:%struct.Base = type { i32, i32 }
  NonVirtualBaseLLVMType:%struct.Base = type { i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>
```

## 添加虚函数之后
```cpp
struct Base {
  Base() = default;
  virtual ~Base() = default;

  void Func();
  virtual void FuncB();

  int a;
  int b;
};

int main() {
  Base b;
  return 0;
}
```
`clang -Xclang -fdump-record-layouts --stdlib=libc++ -c model.cpp`编译之后结果如下，可以看到在最开始添加了8字节的虚函数指针信息
```shell
*** Dumping AST Record Layout
         0 | struct Base
         0 |   (Base vtable pointer)
         8 |   int a
        12 |   int b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]
```
查看虚函数表`clang -Xclang -fdump-vtable-layouts --stdlib=libc++ -c model.cpp`

```shell
Vtable for 'Base' (5 entries).
   0 | offset_to_top (0)
   1 | Base RTTI
       -- (Base, 0) vtable address --
   2 | Base::~Base() [complete]
   3 | Base::~Base() [deleting]
   4 | void Base::FuncB()

VTable indices for 'Base' (3 entries).
   0 | Base::~Base() [complete]
   1 | Base::~Base() [deleting]
   2 | void Base::FuncB()
```